; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v4 - type_3 ?v5 - type_2)
 	      (pred_1 ?v3 - object ?v5 - type_2)
	      (pred_4 ?v4 - type_3 ?v2 - type_1)
	      (pred_3 ?v4 - type_3 ?v3 - object ?v2 - type_1))

   (:action op_2
       :parameters  (?v4 - type_3 ?v7 ?v6 - type_2)
       :precondition (and  (pred_2 ?v4 ?v7))
       :effect (and  (pred_2 ?v4 ?v6)
		     (not (pred_2 ?v4 ?v7))))

   (:action op_1
       :parameters (?v4 - type_3 ?v1 - object ?v8 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v8) (pred_2 ?v4 ?v8) (pred_4 ?v4 ?v2))
       :effect (and (pred_3 ?v4 ?v1 ?v2)
		    (not (pred_1 ?v1 ?v8)) 
		    (not (pred_4 ?v4 ?v2))))

   (:action op_3
       :parameters (?v4 - type_3 ?v1 - object ?v8 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_3 ?v4 ?v1 ?v2) (pred_2 ?v4 ?v8))
       :effect (and (pred_1 ?v1 ?v8)
		    (pred_4 ?v4 ?v2)
		    (not (pred_3 ?v4 ?v1 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_12 obj_09 - type_3
obj_02 obj_01 obj_06 obj_07 - type_1
obj_04 obj_05 obj_11 obj_13 - type_2
obj_14 obj_03 obj_10 obj_08 - object)
(:init
(pred_2 obj_12 obj_13)
(pred_4 obj_12 obj_02)
(pred_4 obj_12 obj_01)
(pred_2 obj_09 obj_05)
(pred_4 obj_09 obj_06)
(pred_4 obj_09 obj_07)
(pred_1 obj_14 obj_13)
(pred_1 obj_03 obj_04)
(pred_1 obj_10 obj_11)
(pred_1 obj_08 obj_05)
)
(:goal
(and
(pred_1 obj_14 obj_05)
(pred_1 obj_03 obj_04)
(pred_1 obj_10 obj_05)
(pred_1 obj_08 obj_13)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_12 obj_13) (pred_2 obj_09 obj_13))))
  )
)
)

; plan
1. (op_1 obj_09 obj_08 obj_05 obj_07)
   deleted: (pred_1 obj_08 obj_05) (pred_4 obj_09 obj_07)
   added: (pred_3 obj_09 obj_08 obj_07)
   goals met: 1 of 4
2. (op_1 obj_12 obj_14 obj_13 obj_01)
   deleted: (pred_1 obj_14 obj_13) (pred_4 obj_12 obj_01)
   added: (pred_3 obj_12 obj_14 obj_01)
   goals met: 1 of 4
3. (op_2 obj_12 obj_13 obj_05)
   deleted: (pred_2 obj_12 obj_13)
   added: (pred_2 obj_12 obj_05)
   goals met: 1 of 4
4. (op_2 obj_09 obj_05 obj_13)
   deleted: (pred_2 obj_09 obj_05)
   added: (pred_2 obj_09 obj_13)
   goals met: 1 of 4
5. (op_3 obj_09 obj_08 obj_13 obj_07)
   deleted: (pred_3 obj_09 obj_08 obj_07)
   added: (pred_1 obj_08 obj_13) (pred_4 obj_09 obj_07)
   goals met: 2 of 4
6. (op_3 obj_12 obj_14 obj_05 obj_01)
   deleted: (pred_3 obj_12 obj_14 obj_01)
   added: (pred_1 obj_14 obj_05) (pred_4 obj_12 obj_01)
   goals met: 3 of 4
7. (op_2 obj_12 obj_05 obj_11)
   deleted: (pred_2 obj_12 obj_05)
   added: (pred_2 obj_12 obj_11)
   goals met: 3 of 4
8. (op_2 obj_09 obj_13 obj_11)
   deleted: (pred_2 obj_09 obj_13)
   added: (pred_2 obj_09 obj_11)
   goals met: 3 of 4
9. (op_1 obj_12 obj_10 obj_11 obj_01)
   deleted: (pred_1 obj_10 obj_11) (pred_4 obj_12 obj_01)
   added: (pred_3 obj_12 obj_10 obj_01)
   goals met: 3 of 4
10. (op_2 obj_12 obj_11 obj_05)
   deleted: (pred_2 obj_12 obj_11)
   added: (pred_2 obj_12 obj_05)
   goals met: 3 of 4
11. (op_3 obj_12 obj_10 obj_05 obj_01)
   deleted: (pred_3 obj_12 obj_10 obj_01)
   added: (pred_1 obj_10 obj_05) (pred_4 obj_12 obj_01)
   goals met: 4 of 4
